### Simulation des changements d'infrastruture Terraform sur scalingo-production
#### Format et Style du code Terraform 🖌 : ✅
#### Validation de la configuration de Terraform (`validate`) 🤖 : ✅
<details><summary>Montrer le résultat de la validation</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 : ✅

<details><summary>Montrer les modifications prévues par Terraform</summary>

```

terraform
data.cloudflare_zone.zone: Reading...
module.front_app.data.environment_variables.scalingo_region_env: Reading...
data.dotenv.envs_du_fichier_env: Reading...
data.dotenv.envs_du_fichier_env: Read complete after 0s [id=�t�ϥ�E��ǧ�C F]
module.front_app.data.environment_variables.scalingo_region_env: Read complete after 0s [id=a52d5483-cc01-a953-737d-83ea36c920f9]
data.statuscake_contact_group.default_contact_group: Reading...
data.statuscake_contact_group.default_contact_group: Read complete after 1s [id=274651]
data.cloudflare_zone.zone: Read complete after 1s [id=2df6de52b2ef58de5641d2f2f6b55e78]
cloudflare_record.domaine_analytics_eulerian["yssn.1jeune1solution.gouv.fr"]: Refreshing state... [id=37d486ba9e885a51769a8f755d0220b6]
module.front_app.data.scalingo_scm_integration.scm_integration["github"]: Reading...
module.front_app.data.scalingo_stack.stack: Reading...
module.front_app.data.scalingo_scm_integration.scm_integration["github"]: Read complete after 1s [id=8abb0726-3707-456b-823c-f119d20740aa]
module.front_app.data.scalingo_stack.stack: Read complete after 1s [id=st-528ed067-917a-4931-875a-40b7500c724a]
module.front_app.scalingo_app.app: Refreshing state... [id=630f7a67fb0de6000f0ecc04]
statuscake_uptime_check.http_check: Refreshing state... [id=6673782]
cloudflare_record.domaine["www.1jeune1solution.gouv.fr"]: Refreshing state... [id=0762a5bea7009fabe797df4bf794f337]
cloudflare_record.domaine_racine["1jeune1solution.gouv.fr"]: Refreshing state... [id=44b48c023048ec7b4075fb53565cd194]
module.front_app.scalingo_scm_repo_link.scm_repo_link["github"]: Refreshing state... [id=630f7a67fb0de6000f0ecc04]
module.front_app.scalingo_container_type.containers["web"]: Refreshing state... [id=1j1s-front-prod:web]
module.front_app.scalingo_domain.canonical_domain["www.1jeune1solution.gouv.fr"]: Refreshing state... [id=64634ff0623d3a00105daccf]
module.front_app.scalingo_domain.domain_aliases["1jeune1solution.gouv.fr"]: Refreshing state... [id=631b0cae623d3a000fd7e17e]
module.front_app.scalingo_addon.addons["redis"]: Refreshing state... [id=ad-534f3384-4850-4f1a-a043-bfdd429c60d7]
module.front_app.scalingo_log_drain.log_drain["elk"]: Refreshing state... [id=8a9f5f545bd0c17442a5d30e967b3bf89552b33426ab3f86227175cb3aadb1b5]
module.front_app.scalingo_autoscaler.autoscalers["web"]: Refreshing state... [id=sc-8c6c0cba-f8e6-4a9c-810b-2f97617a4ccf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.front_app.scalingo_addon.addons["redis"] must be replaced
-/+ resource "scalingo_addon" "addons" {
      ~ app               = "1j1s-front-prod" -> "630f7a67fb0de6000f0ecc04" # forces replacement
      ~ id                = "ad-534f3384-4850-4f1a-a043-bfdd429c60d7" -> (known after apply)
      ~ plan_id           = "5cc45b2218e5470015111bfc" -> (known after apply)
      ~ resource_id       = "1j1s-front-prod-4320" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.front_app.scalingo_app.app will be updated in-place
  ~ resource "scalingo_app" "app" {
      ~ environment     = {
          ~ "SENTRY_RELEASE"                               = (sensitive value)
            # (66 unchanged elements hidden)
        }
        id              = "630f7a67fb0de6000f0ecc04"
        name            = "1j1s-front-prod"
        # (7 unchanged attributes hidden)
    }

  # module.front_app.scalingo_autoscaler.autoscalers["web"] must be replaced
-/+ resource "scalingo_autoscaler" "autoscalers" {
      ~ app            = "1j1s-front-prod" -> "630f7a67fb0de6000f0ecc04" # forces replacement
      - disabled       = false -> null
      ~ id             = "sc-8c6c0cba-f8e6-4a9c-810b-2f97617a4ccf" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.front_app.scalingo_container_type.containers["web"] must be replaced
-/+ resource "scalingo_container_type" "containers" {
      ~ app    = "1j1s-front-prod" -> "630f7a67fb0de6000f0ecc04" # forces replacement
      ~ id     = "1j1s-front-prod:web" -> (known after apply)
        name   = "web"
        # (2 unchanged attributes hidden)
    }

  # module.front_app.scalingo_domain.canonical_domain["www.1jeune1solution.gouv.fr"] must be replaced
-/+ resource "scalingo_domain" "canonical_domain" {
      ~ app         = "1j1s-front-prod" -> "630f7a67fb0de6000f0ecc04" # forces replacement
      ~ id          = "64634ff0623d3a00105daccf" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.front_app.scalingo_domain.domain_aliases["1jeune1solution.gouv.fr"] must be replaced
-/+ resource "scalingo_domain" "domain_aliases" {
      ~ app         = "1j1s-front-prod" -> "630f7a67fb0de6000f0ecc04" # forces replacement
      ~ id          = "631b0cae623d3a000fd7e17e" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.front_app.scalingo_log_drain.log_drain["elk"] must be replaced
-/+ resource "scalingo_log_drain" "log_drain" {
      ~ app       = "1j1s-front-prod" -> "630f7a67fb0de6000f0ecc04" # forces replacement
      ~ drain_url = (sensitive value)
      ~ id        = "8a9f5f545bd0c17442a5d30e967b3bf89552b33426ab3f86227175cb3aadb1b5" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

Pour appliquer les changements proposés par ce plan :
- en recette : il suffit de merger cette PR
- en production : il faut merger la PR de release (créée par release-please)

*Environnement: `scalingo-production`, Auteur: @josephpage, Répertoire: `./terraform`*